import imageLogo from '@/shared/images/logo_white.svg'
import imageBig from '@/shared/images/reg_cover.png'
import type { Metadata } from 'next'
import Image from 'next/image'
import { FC } from 'react'
import { AuthForm } from '../login/auth-form/AuthForm'
import styles from '../login/Login.module.scss'
export const metadata: Metadata = {
	title: 'Register',
}

const Registration: FC = () => {
	return (
		<div className={styles.wrapperMain}>
			<div className={styles.wrapper}>
				<div className={styles.wrapperBigImage}>
					<Image
						alt='Картинка входа'
						src={imageBig}
						className={styles.bigImage}
						draggable={false}
					/>
					<Image
						alt='Картинка логотипа'
						src={imageLogo}
						className={styles.Logo}
						draggable={false}
					/>
					<p>
						«Выйди на новый уровень владения английским с помощью силы
						искусственного интеллекта»
					</p>
				</div>
				<div className={styles.Reg_column}>
					<div className={styles.wrapperLogo}>
						<svg
							xmlns='http://www.w3.org/2000/svg'
							width='29'
							height='29'
							viewBox='0 0 29 29'
							fill='none'
						>
							<path
								fillRule='evenodd'
								clipRule='evenodd'
								d='M14.8374 0.320317C14.4551 -0.106773 13.7864 -0.106772 13.4041 0.320318L10.2942 3.79412C10.0994 4.01178 9.81616 4.12909 9.52447 4.11297L4.86914 3.8556C4.29678 3.82396 3.82396 4.29678 3.8556 4.86914L4.11297 9.52447C4.12909 9.81617 4.01178 10.0994 3.79412 10.2942L0.320317 13.4041C-0.106773 13.7864 -0.106772 14.4551 0.320318 14.8374L3.79412 17.9473C4.01178 18.1421 4.12909 18.4253 4.11297 18.717L3.8556 23.3724C3.82396 23.9447 4.29678 24.4175 4.86914 24.3859L9.52447 24.1285C9.81617 24.1124 10.0994 24.2297 10.2942 24.4474L13.4041 27.9212C13.7864 28.3483 14.4551 28.3483 14.8374 27.9212L17.9473 24.4474C18.1421 24.2297 18.4253 24.1124 18.717 24.1285L23.3724 24.3859C23.9447 24.4175 24.4175 23.9447 24.3859 23.3724L24.1285 18.717C24.1124 18.4253 24.2297 18.1421 24.4474 17.9473L27.9212 14.8374C28.3483 14.4551 28.3483 13.7864 27.9212 13.4041L24.4474 10.2942C24.2297 10.0994 24.1124 9.81616 24.1285 9.52447L24.3859 4.86914C24.4175 4.29678 23.9447 3.82396 23.3724 3.8556L18.717 4.11297C18.4253 4.12909 18.1421 4.01178 17.9473 3.79412L14.8374 0.320317ZM14.6474 6.27676C14.3921 5.91205 13.8519 5.91205 13.5967 6.27676L12.1198 8.38669C11.9768 8.59091 11.7284 8.69379 11.4829 8.65046L8.94667 8.20284C8.50827 8.12547 8.12634 8.5074 8.20371 8.94581L8.65133 11.4821C8.69465 11.7276 8.59178 11.9759 8.38755 12.1189L6.27763 13.5958C5.91291 13.8511 5.91291 14.3912 6.27763 14.6465L8.38755 16.1234C8.59178 16.2663 8.69465 16.5147 8.65133 16.7602L8.20371 19.2965C8.12634 19.7349 8.50827 20.1168 8.94667 20.0394L11.4829 19.5918C11.7284 19.5485 11.9768 19.6514 12.1198 19.8556L13.5967 21.9655C13.8519 22.3302 14.3921 22.3302 14.6474 21.9655L16.1243 19.8556C16.2672 19.6514 16.5156 19.5485 16.7611 19.5918L19.2973 20.0394C19.7357 20.1168 20.1177 19.7349 20.0403 19.2965L19.5927 16.7602C19.5494 16.5147 19.6522 16.2663 19.8565 16.1234L21.9664 14.6465C22.3311 14.3912 22.3311 13.8511 21.9664 13.5958L19.8565 12.1189C19.6522 11.9759 19.5494 11.7276 19.5927 11.4821L20.0403 8.94581C20.1177 8.5074 19.7357 8.12547 19.2973 8.20284L16.7611 8.65046C16.5156 8.69379 16.2672 8.59091 16.1243 8.38669L14.6474 6.27676Z'
								fill='#EB5931'
							/>
						</svg>
						<h3>Fife</h3>
					</div>

					<h2>Создать аккаунт</h2>
					<h3>Начните улучшать английский уже сегодня</h3>
					<AuthForm isLogin={false} />
				</div>
			</div>
		</div>
	)
}

export default Registration
